In [1]:
import pandas as pd

In [2]:
df1 = pd.read_csv('d1.csv')
df2 = pd.read_csv('d2.csv')

In [3]:
display(df1,df2)

     name  age
0  hassan   23
1     ali   25
2   usman   28
3   akbar   45
4    babo   48

     name  age
0  hassan   23
1   zahad   29
2    umar   35
3    babo   48

In [7]:
df = pd.merge(df1,df2)  #### by default merge is INTERSECTION
df

     name  age
0  hassan   23
1    babo   48

In [8]:
df = pd.merge(df1, df2, how = 'outer')
df

     name  age
0  hassan   23
1     ali   25
2   usman   28
3   akbar   45
4    babo   48
5   zahad   29
6    umar   35

In [9]:
df1 = pd.read_csv('join1.csv')
df2 = pd.read_csv('join2.csv')

In [10]:
display(df1,df2)

        city        place
0     lahore   johar town
1  faislabad  behria town
2    karachi   sefia town

  education  population
0        top          5M
1     middle          2M
2        top         10M

In [11]:
df = df1.join(df2)

In [12]:
df

        city        place education  population
0     lahore   johar town        top          5M
1  faislabad  behria town     middle          2M
2    karachi   sefia town        top         10M